Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/jobseekers_benefit.html.txt.tmx
Source language: en
Languages: ga

source: For example, if you claim Jobseeker's Benefit in 2017 the relevant tax year is 2015
ga: Mar shampla, má tá tú ag éileamh Sochar Cuardaitheora Poist i 2017, is í 2015 an bhliain chánach ábhartha

source: If you only qualify for a reduced JB payment, it may of greater benefit for you to claim Jobseeker's Allowance instead of Jobseeker's Benefit
ga: Má thagann tú isteach faoin riail seo b'fhéidir gur bhfearr duit iarratas a dhéanamh ar Liúntas Cuardaitheora Poist seachas ar Sochar an Chuardaitheora Poist

source: This increase is called an Increase for a Qualified Adult (IQA)
ga: I gcásanna áirithe, is féidir éileamh ar SCP le héileamh níos sine a cheangal

source: If your adult dependant is earning €100 or less you will get the maximum IQA
ga: Sa chás seo, ní bheidh d' éileamh SCP mar éileamh nua, beidh sé ceangailte le d' éileamh roimhe sin

source: If he or she is earning between €100 and €310 you will get a reduced rate of IQA
ga: Má tá d'éileamh ceangailte le héileamh déanta is luaithe ná 2009 tá rátaí grádaithe mar a leanas:

source: If your JB claim is linked to a claim earlier than 2009 the following graduated rates apply:
ga: Éilimh SCP a thosaigh i 2009

source: │Average weekly earnings │Personal rate │Qualified adult rate │
ga: │Meánthuilleamh │Ráta │Méadú do Dhuine Fásta│

source: │Less than €80 │€86.70 │€83.00 │
ga: │Níos lú ná €80 │€86.70 │€83.00 │

source: │€150 or more │€193.00 │€128.10 │
ga: │Níos mó ná €150 │€193.00 │€128.10 │

source: You can collect your Jobseeker's Benefit payment weekly from your nearest Post Office
ga: Is féidir do Shochar Cuardaitheora Poist a bhailiú ón Oifig an Phoist is gaire duit gach seachtain

source: You must bring valid photographic identification (photo ID) with you to collect your payment
ga: Ní mór duit aitheantas fótagrafach bailí a thabhairt leat chun d'íocaíocht a bhailiú

source: The following is regarded as valid photo ID:
ga: Meastar na cáipéisí seo leanas mar aitheantas fótagrafach bailí:

source: Staff working in the Post Office may ask to see your photo ID before giving you your payment
ga: Is féidir an fhoireann ag obair san Oifig an Phoist iarr ort d'aitheantas fótagrafach a fheiceáil roimh ag tabhairt d'íocaíocht duit

source: Taxation of Jobseeker's Benefit
ga: Gearradh cánach ar Shochar Cuardaitheora Poist

source: Jobseeker's Benefit is taxable
ga: Tá Sochar Cuardaitheora Poist inchánach

source: However, if you are getting Jobseeker's Benefit because your normal working week has been reduced temporarily (systematic short-time work) your Jobseeker's Benefit is not taxed
ga: Áfach, má tá tú ag fáil Sochar Cuardaitheora Poist mar tá do sheachtain oibre giorraithe (obair ghearr-ama córasach), ní ghearrfar cáin ar do Shochar Cuardaitheora Poist

source: If you are working part-time and getting Jobseeker’s Benefit for the days you are not employed your Jobseeker’s Benefit is taxable
ga: Leath-ráta Sochair Cuardaitheora Poist le híocaiocht leasa shoisialaigh eile

source: Find out more about the taxation of Jobseeker's Benefit and the taxation of JB for systematic short-time workers
ga: Ní íocfar Méadú do leanbh Cleithúnach leat mar go bhfuil an íocaíocht a fháil agat orthu cheanna féin sa phríomh íocaíocht a fhaigheann tú

source: If you are getting Jobseeker's Benefit, you may be entitled to:
ga: Má tá tú ag tarraingt Sochar Cuardaitheora Poist b'fhéidir go bhfuil tú i dteideal :

source: • Rent Supplement - a payment under the Supplementary Welfare Allowance scheme
ga: • Forlíonadh Cíos - íocaíocht a fhaigheann tú ón Oifigeach Curam Pobail i do Ionad Sláinte áitiúil

source: • Back to School Clothing and Footwear Allowance - an allowance to help with the cost of uniforms and footwear for children who are attending school
ga: Íoctar amach an scéim idir Mí Meitheamh agus mí Mean Fhómhair gach bliain - Déan teangmháil le d'oifig sláinte áitiúil

source: • Medical card - if your income is below a certain level, you may get a medical card
ga: • Cárta Leighis - Má tá do ioncam níos ísle ná méid áirithe beidh tú i dteideal cárta leighis ón Roinn Sláinte

source: You do not qualify for the Household Benefits Package or Free Travel with Jobseeker’s Benefit
ga: Má fhaigheann tú Sochar Cuardaitheora Poist, ní bheidh tú incháilithe le haghaidh Pacáiste Sochar Teaghlaigh nó Saor Thaisteal

source: You should apply for Jobseeker's Benefit the first day you become unemployed
ga: Ba chóir duit iarratas a dhéanamh ar Shochar Cuardaitheora Poist an chéad lá atá tú dífhostaithe

source: It is important to apply on the first day you become unemployed because you will not get paid for the first 3 days of your claim
ga: Tá sé tábhachtach iarratas a dhéanamh an chéad lá dífhostaíochta toisc ní bheidh tú íoctha do na 3 lá d'éilimh tosaigh

source: Jobseeker's Benefit application forms are available online
ga: Tá foirmeacha Sochair Cuardaitheora Poist ar fáil ar líne anois

source: You can also get an application form from your local Social Welfare Branch Office or Intreo Centre
ga: Is féidir leat foirm iarratais a fháil ó d'oifig leasa shóisialaigh áitiúil

source: You will also need certain documents when you apply for Jobseeker's Benefit
ga: Ní mór duit cáipéisí áirithe a thabhairt leat chun d'éileamh a chruthú

source: If you do not have these documents to hand, you should apply anyway and supply them later
ga: Tá liosta na cáipéisí atá gá duit nuair tá tú ag déanamh iarratas ar Shochar Cuardaitheora Poist

source: You should remember that delay in applying for Jobseeker's Benefit may mean that you lose out on your full entitlements
ga: Mura bhfuil na cáipéisí seo agat faoi láthair ba chóir duit iarratas a dhéanamh agus iad a fháil ina dhiaidh sin

source: You can get help to fill in your application form at your Intreo Centre, Social Welfare Branch Office or Citizens Information Centre
ga: Ná déan dearmad má bhíonn tú déanach ag cur d'iarratas isteach ar Shochar Cuardaitheora Poist b'fhéidir go gcaillfeá roinn airgid dá bharr

source: More information is available in our document about signing on for the first time
ga: Is féidir le d'oifig leasa shóisialaigh áitiúil nó Lárionad Faisnéise do Shaoránaigh cuidiú leat chun d'fhoirm iarratais a chomhlánú

source: If you think you have been wrongly refused Jobseeker's Benefit you can appeal the decision
ga: Tá tuilleadh eolais faoi iarratas ar Shochar Cuardaitheora Poist ar fáil sa doiciméid maidir le ag siniú don chéad uair

source: You should apply for Jobseeker's Benefit to your Intreo Centre or Social Welfare Branch Office. Further information
ga: Má cheapann tú go bhfuil sochar diúltaithe duit go héagórach, is féidir achomharc a chur

source: These half-rate payments were discontinued from February 2012
ga: Cá háit a ndéanfaidh mé iarratas?

source: Claimants getting Jobseeker's Benefit for 6 months or more on 3 April 2013 (or 3 months for people with fewer than 260 contributions) were not affected (see table below)
ga: Ba chóír duit d'iarratas ar Shochar Cuardaitheora Poist a thabhairt isteach ag d'Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh
